{
  "basics": {
    "name": "Teodora Spasojevic",
    "label": "M.Sc. with majors in Artificial Intelligence and Autonomous Driving",
    "image": "",
    "email": "spasojevic.teodora@gmail.com",
    "phone": "(+49) 176-311-45-217",
    "location": {
      "address": "Stintzingstr. 29",
      "postalCode": "90152",
      "city": "Erlangen",
      "countryCode": "Germany",
      "region": "Bavaria"
    },
    "profiles": []
  },
  "work": [
    {
      "name": "Mercedes-Benz AG, Autonomous Driving R&D Team",
      "position": "Master's Thesis Student",
      "location": "Stuttgart, Germany",
      "startDate": "2025-05-12",
      "endDate": "2025-11-11",
      "summary": "• I have worked on my thesis on topic of Consistency-aware Video Generation: Dynamic, Semantic, and Geometric Constraints for Improved Temporal Coherence. In the thesis, I enhance temporal consistency of video generation (VG) in an end-to-end multimodal manner. I propose a novel framework for fine-tuning pretrained VG models (specifically Stable Video Diffusion), while keeping the inference control-free. The framework enforces dynamic, semantic, and depth consistency using a set of losses. These losses compare outputs of off-the-shelf object detection (DN-DETR), feature extraction (DINO), sematic segmentation (SAM), and depth estimation (DepthAnything) models between ground-truth and generated videos. For this work, I have designed distributed training and evaluation pipelines deployed on GCP with Flyte, using support of accelerate library. \n • Additionally, I have contributed to a scientific publication accepted to the IEEE IV 2026 conference, based on this thesis, conducting all the experiments and contributing to the manuscript preparation."
    },
    {
      "name": "Mercedes-Benz AG, Autonomous Driving R&D Team",
      "position": "Intern",
      "location": "Stuttgart, Germany",
      "startDate": "2024-11-15",
      "endDate": "2025-04-15",
      "summary": "• During this research-driven internship, I have researched the fields of diﬀusion-based video generative and world models (WM) and conditioning mechanisms (ControlNet). This research contributed to a master’s thesis proposal. \n • I have experimented with models: Stable Video Diffusion (SVD), Vista WM, Cosmos WM and Ctrl-V (SVD with ControlNet). \n • Used infrastructure: Google’s cloud computing service (GCP) with Flyte and Weights&Biases support. I have developed a tutorial on GCP and workflow setup for GCP, now used by the team. \n • Participated and presented my work in team research sync meetings."
    },
    {
      "name": "Friedrich-Alexander University Erlangen-Nuremberg",
      "position": "Research Assistant",
      "location": "Erlangen, Germany",
      "startDate": "2024-06-01",
      "endDate": "2024-11-14",
      "summary": "Implemented a new initialization algorithm for Bilinear Expectation Propagation (EP) algorithm, part of a Cell-Free 6G Information Theory Project. New initialization lead to accuracy increase of the EP algorithm. Experiments were run on a high-computing cluster."
    },
    {
      "name": "TTTech Auto",
      "position": "Software Engineer Intern",
      "location": "Belgrade, Serbia",
      "startDate": "2023-03-01",
      "endDate": "2023-08-31",
      "summary": "Completed my bachelor thesis on the topic of Real-time Traffic Light Detection in the CARLA Simulator. The work included usage of signal processing tools with at the time SOTA object detection model (YOLO) with real-time capabilities, and integrating it into CARLA simulator."
    },
    {
      "name": "University of Belgrade, School of Electrical Engineering",
      "position": "Undergraduate Teaching Assistant",
      "location": "Belgrade, Serbia",
      "startDate": "2021-03-01",
      "endDate": "2023-07-01",
      "summary": "Undergraduate Teaching Assistant on courses of Signals and Systems and Automatic Control Systems, where I assisted in laboratory education and assessed students’ homework and lab performance."
    }
  ],
  "volunteer": [
    {
      "organization": "SUETF (Student Organization)",
      "location": "Belgrade, Serbia",
      "position": "Student Mentor",
      "startDate": "2021-10-01",
      "endDate": "2022-10-01",
      "summary": "Helping first-year undergraduate students excel academically and thrive in their educational journey through personalized guidance and support."
    }
  ],
  "education": [
    {
      "institution": "Friedrich-Alexander University Erlangen-Nuremberg",
      "location": "Erlangen, Germany",
      "url": "https://www.fau.de/",
      "area": "Artificial Intelligence",
      "studyType": "Master's",
      "startDate": "2023-10-01",
      "endDate": "2025-12-04",
      "score": "1.4",
      "summary": "• Department: Electromobility-ACES with majors in AI, Autonomous Driving and Communication. \n • Scientific Project: Uncertainty Estimation for Video Generative models. \n • Minor Projects: Vision Transformer, LSTM, RNN implementation; Imitation Learning. \n • Courses: CV, RL, Advanced DL (including advanced concepts as Explainability, Uncertainty) etc."
    },
    {
      "institution": "University of Belgrade, School of Electrical Engineering",
      "location": "Belgrade, Serbia",
      "url": "https://www.etf.bg.ac.rs/en",
      "area": "Electrical Engineering and Computing",
      "studyType": "Bachelor's",
      "startDate": "2019-10-01",
      "endDate": "2023-07-06",
      "score": "9.33/10.00 (equivalent to 1.5 in German grading system)",
      "summary": "Activities and societies: Undergraduate Teaching Assistant on courses Signals and Systems and Automatic Control Systems 2021-23; focused in AI, ML, Computer Science, Mathematics, Signal Processing. \n Department: Signals and Systems"
    }
  ],
  "scholarships": [
    {
      "title": "BAYHOST Scholarship",
      "date": "2024-10-01",
      "awarder": "BAYHOST",
      "url": "https://www.uni-regensburg.de/en/bayhost"
    },
    {
      "title": "Scholarship for Exceptionally Gifted Students",
      "date": "2021-10-01",
      "awarder": "Ministry of Education, Science and Technological Development of Republic of Serbia",
      "summary": ""
    }
  ]
  "publications": [
    {
      "name": "LSA: Localized Semantic Alignment for Enhancing Temporal Consistency in Traffic Video Generation",
      "publisher": "IEEE Intelligent Vehicles (IV) 2026",
      "releaseDate": "2026-15-01",
      "url": "https://teodoraspasojevic.github.io/lsa-project-page/",
      "summary": "Localized Semantic Alignment (LSA) improves temporal consistency in diffusion-based traffic video generation within single fine-tuning epoch and with no inference-time control signals."
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Professional Profficiency",
      "icon": ""
    },
    {
      "language": "German",
      "fluency": "Basic Level",
      "icon": ""
    },
    {
      "language": "Serbian",
      "fluency": "Native Speaker",
      "icon": ""
    },
    {
      "language": "Franch",
      "fluency": "Basic Level",
      "icon": ""
    }
  ]
}
